package com.example.project2309.data;

public class TermData {

    public static String TermIntentName = "TermType";
    public static int 이용약관 = 0;
    public static int 개인정보처리방침 = 1;


    private String 이용약관제목 = "이용 약관";
    private String 개인정보처리방침제목 = "개인정보 처리방침";

    private String 이용약관정보(){
        return "Project2309 이용약관\n" +
                "\n" +
                "제1장 총칙\n" +
                "제1조 (목적)\n" +
                "본 약관은 Project2309(이하 “회사”라 합니다)가 제공하는 정보서비스(이하 “서비스”라 합니다)의 이용과 관련하여 회사와 회원 사이에 권리ㆍ의무 및 책임사항 등을 규정함을 목적으로 합니다.\n" +
                "\n" +
                "제2조 (정의)\n" +
                "① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.\n" +
                "1. \"회사\"라 함은 \"콘텐츠\" 산업과 관련된 경제활동을 영위하는 자로서 콘텐츠 및 제반서비스를 제공하는 자를 말합니다.\n" +
                "2. “이용자”라 함은 회사의 웹사이트에 접속하여 본 약관에 따라 회사가 제공하는 콘텐츠 및 제반서비스를\n" +
                "이용하는 회원 및 비회원을 말합니다.\n" +
                "3. “회원”이라 함은 회사의 웹사이트에 접속하여 본 약관에 동의함으로써 회사와 이용계약을 체결하고\n" +
                "아이디(ID)를 부여받은 자로서 회사가 제공하는 정보와 서비스를 지속적으로 이용할 수 있는 자를 말합니다.\n" +
                "4. “콘텐츠”라 함은 회사 및 이용자가 제작하여 웹사이트에서 제공 및 판매하는 모든 것을 의미함으로서, 정보통신망이용촉진 및 정보보호 등에 관한 법률 제2조 제1항 제1호의 규정에 의한 정보통신망에서 사용되는 부호ㆍ문자ㆍ음성ㆍ음향ㆍ이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.\n" +
                "5. “아이디(ID)”라 함은 회원의 식별 및 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자 또는\n" +
                "숫자의 조합 형태의 이메일을 말합니다.\n" +
                "6. “비밀번호(PASSWORD)”라 함은 회원이 서비스 이용 시, 아이디와 일치되는 회원임을 확인하고 회원 개인정보\n" +
                "보호를 위하여 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.\n" +
                "7. “닉네임”이라 함은 회원이 서비스 이용 시, 회원을 식별하기 위하여 사용 되는 문자 또는 숫자의 조합형태를 말합니다.\n" +
                "7. “운영자(관리자)”라 함은 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 사람 또는\n" +
                "회사를 말합니다.\n" +
                "8. “회원의 게시물”이라 함은 회사의 서비스가 제공되는 웹사이트에 회원이 올린 글, 이미지, 각종 파일 및 링크,\n" +
                "각종 덧글 등의 정보를 의미합니다.\n" +
                "② 전항 각호에 해당하는 정의 이외의 기타 용어의 정의에 대하여는 거래 관행 및 관계 법령에 따릅니다.\n" +
                "\n" +
                "제3조(회사 신원정보 등의 제공)\n" +
                "회사는 회사의 상호, 대표자 성명, 주소, 전화번호(소비자의 불만을 처리하는 곳의 연락처 포함), 전자우편주소, 사업자등록번호 및 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 온라인 서비스 초기화면에 게시합니다.\n" +
                "\n" +
                "제4조 (약관의 게시 등)\n" +
                "① 회사는 이용자가 별도의 연결화면을 통하여 약관을 확인할 수 있도록 회사 웹사이트에 게시하며, 약관의 전문을 출력할 수 있도록 하고 있습니다.\n" +
                "\n" +
                "제5조 (약관의 개정)\n" +
                "① 회사는 관계법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.\n" +
                "② 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여, 개정 전 약관과 함께 적용일 7일 전부터 회사 웹사이트 또는 개별고지를 통해서 확인할 수 있도록 게시하며, 기존 회원에게는 본 약관 제7조의 방법을 통하여 약관 개정사실을 통지합니다.\n" +
                "③ 기존 회원이 변경된 약관에 동의하지 않는 경우 서비스 이용을 중단하고 회원탈퇴를 할 수 있습니다.\n" +
                "\n" +
                "제6조 (약관의 효력)\n" +
                "① 본 약관은 이용자가 약관의 내용에 동의하며 회원가입을 신청하고, 회사가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.\n" +
                "② 회사는 기존 회원이 본 약관 제5조 제2항에 따른 공지 또는 통지에도 불구하고, 동 기간 내에 이의를 제기하지 않는 경우에는 변경된 약관을 승인한 것으로 봅니다.\n" +
                "③ 본 약관에 명시되지 않은 사항에 대해서는 “약관의 규제에 관한 법률”, “정보통신망 이용촉진 및 정보보호 등에 관한 법률”, “전자상거래 등에서의 소비자보호에 관한 법률”, “학원의 설립·운영 및 과외교습에 관한 법률”, “콘텐츠 산업 진흥법” 및 기타 관련법령 또는 상관례에 따릅니다.\n" +
                "\n" +
                "제7조 (“회원”에 대한 통지)\n" +
                "① 회사는 회원에게 알려야 할 사항이 발생하는 경우, 회원가입 시 회원이 공개한 전자우편주소 또는 팝업창, 유ㆍ무선 등의 방법으로 통지할 수 있습니다.\n" +
                "② 회사는 회원 전체에 대한 통지의 경우 7일 이상 회사 웹사이트 공지사항에 게시함으로써 전항의 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래 및 사이트의 이용과 관련하여 중대한 영향을 미치는 사항에 대하여는 14일 이상 전항과 동일한 방법으로 별도 통지할 수 있습니다.\n" +
                "\n" +
                "제2장 회원가입\n" +
                "\n" +
                "제8조 (회원가입)\n" +
                "① 회원으로 가입하여 회사 서비스의 이용을 희망하는 자는 약관의 내용을 숙지한 후 동의함을 표시하고, 회사가 제시하는 소정의 회원가입 양식에 관련사항을 기재하여 회원가입을 신청하여야 합니다.\n" +
                "② 회사는 전항에 따라 이용자가 온라인 회원가입 신청양식에 기재하는 모든 회원정보를 실제 데이터인 것으로 간주합니다.\n" +
                "③ 실제 정보를 입력하지 않은 회원은 법적인 보호를 받을 수 없으며, 본 약관의 관련 규정에 따라 서비스 사용에 제한을 받을 수 있습니다.\n" +
                "④ 회사는 본조 제1항에 따른 이용자의 신청에 대하여 회원가입을 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있으며, 승낙 이후라도 취소할 수 있습니다.\n" +
                "1. 이용자의 귀책사유로 인하여 승인이 불가능한 경우\n" +
                "2. 타인의 명의 또는 개인정보를 도용하는 경우\n" +
                "3. 허위의 정보를 제공하는 경우\n" +
                "4. 중복된 아이디를 사용하는 경우\n" +
                "5. 중복된 닉네임을 사용하는 경우\n" +
                "6. 회사가 제시하는 회원가입 신청양식에 관련 내용을 기재하지 않은 경우\n" +
                "7. 이전에 회사 이용약관 또는 관계법령을 위반하여 회원자격이 상실되었던 경우\n" +
                "8. 본 약관 제19조 (회원의 의무)를 위반하는 경우\n" +
                "9. 기타 본 약관 및 관계법령을 위반하는 경우\n" +
                "10. 회원가입 신청양식에 기재되어 회사에 제공되는 개인정보(ID, 비밀번호, 전자우편주소 등)가 선량한 풍속 기타\n" +
                "사회질서에 위배되거나 타인을 모욕하는 경우\n" +
                "⑤ 회사는 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.\n" +
                "⑥ 회사가 본조 제4항과 제5항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우에는 팝업창을 통하여 즉시 이용자(신청자)에게 알립니다. 단, 회사의 귀책사유 없이 이용자에게 알릴 수 없는 경우에는 예외로 합니다.\n" +
                "\n" +
                "제9조 (회원정보의 변경)\n" +
                "① 회원은 회사 웹사이트 “정보수정” 페이지에서 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.\n" +
                "② 회원이 전항의 변경사항을 수정하지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.\n" +
                "\n" +
                "제10조 (“회원”의 “아이디” 및 “비밀번호”의 관리에 대한 의무)\n" +
                "① 회원은 아이디와 비밀번호에 대한 관리책임이 있으며, 이를 타인에게 공개하여 제3자가 이용하도록 하여서는 안됩니다.\n" +
                "② 회원은 자신의 아이디 및 비밀번호가 유출되어 제3자에 의해 사용되고 있음을 인지한 경우, 즉시 회사에 알려야 합니다.\n" +
                "③ 회사는 전항의 경우 회원의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 회원에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, 회원은 회사의 요구가 있는 즉시 회사의 요청에 성실히 응해야 합니다.\n" +
                "④ 회사는 회원이 본조 제2항 및 제3항에 따른 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.\n" +
                "\n" +
                "제11조 (이용계약의 해지·해제 등)\n" +
                "① 회원이 이용계약의 해지 또는 해제를 원할 경우에는 본인이 회사 고객센터에 전화접수를 하거나 웹사이트를 통하여 신청할 수 있으며, 회사는 회원의 의사표시를 수령한 후 지체없이 이러한 사실을 회신하고 본 약관에 따라 이용계약 해지등의 조치를 취합니다.\n" +
                "② 회사는 회원이 본 약관 또는 관계법령 등을 위반하는 경우, 이용계약을 해지할 수 있습니다.\n" +
                "\n" +
                "제3장 서비스 이용\n" +
                "\n" +
                "제12조 (서비스의 원활한 이용)\n" +
                "① 회사는 서비스의 원활한 제공을 위하여 회원이 회사 웹사이트 접속 시, 본 약관 13조 1항에 해당하는 조건에 맞는 사양으로 웹사이트 접속하시기를 권장합니다.\n" +
                "② 회원이 회사에서 권장하는 본조 제1항의 확인 하지 않을시에 일부 서비스 이용에 어려움이 있을 수 있습니다.\n" +
                "\n" +
                "제13조 (콘텐츠 이용에 필요한 기술사양)\n" +
                "① 회사가 제공하는 콘텐츠를 이용하는데 필요한 PC의 최소사양은 아래와 같습니다.\n" +
                "- CPU: 2세대 Core i5(2GHz+), 3세대/4세대 Core i5 또는 이에 상응하는 프로세서\n" +
                "- 메모리: 2G 이상\n" +
                "- HDD: C:\\ 공간이 20GB이상\n" +
                "- VGA : Intel HD4000 또는 이에 상응하는 그래픽\n" +
                "- 운영체제 : Windows 7 이상\n" +
                "- Internet Explorer : 10.0 이상\n" +
                "- Chrome : 62.0 이상\n" +
                "② 회사가 제공하는 콘텐츠를 이용할 수 있는 기술사양은 고객센터에 전화 또는 메일로 문의하거나 확인할 수 있습니다.\n" +
                "\n" +
                "제14조 (회사의 의무)\n" +
                "① 회사는 법령과 본 약관이 정하는 권리의 행사와 의무의 이행을 신의에 좇아 성실하게 하여야 합니다.\n" +
                "② 회사는 회원이 서비스를 이용하는 과정에서 회원 개인정보가 외부로 유출되지 않도록 방화벽을 설치하는 등 별도의 보안장치를 사용하고 있으며, 그 구체적인 내용은 회사 웹사이트의 “개인정보처리방침”에서 확인할 수 있습니다.\n" +
                "③ 회사는 서비스 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 그 처리과정 및 결과를 전달합니다.\n" +
                "\n" +
                "제15조 (회원의 의무)\n" +
                "① 회사의 명시적 동의가 없는 한 회원의 이용권한은 회원 개인에 한정되며, 타인에게 양도, 증여하거나 이를 담보 등으로 제공할 수 없습니다.\n" +
                "② 회사는 회원이 다음 각호의 1에 해당하는 의무를 위반 하였을 경우, 기간을 정하여 전부 또는 일부의 서비스 이용을 중지하거나 상당기간의 시정권고 후 이용계약을 해지할 수 있습니다.\n" +
                "1. 회원이 이용신청 또는 변경 시, 허위사실을 기재하거나 자신 또는 다른 회원의 ID 및 개인정보를\n" +
                "이용ㆍ공유하는 경우\n" +
                "2. 회원이 회사 또는 제3자의 권리 등을 침해하는 경우\n" +
                "3. 회원이 회사에서 제공하는 서비스를 이용하여 상품 또는 용역을 판매하는 영업활동 등의 상행위를 하는 경우\n" +
                "4. 회원이 다른 이용자의 서비스 이용을 방해하거나 회사의 운영진, 직원 또는 관계자를 사칭하는 경우\n" +
                "5. 회원이 회사 웹사이트 내에서 사회의 안녕질서 혹은 미풍양속을 저해하는 행위를 하거나, 그와\n" +
                "관련된 부호ㆍ문자ㆍ음성ㆍ음향 및 영상 등의 정보를 게시하여 타인에게 유포시키는 경우\n" +
                "6. 회원이 회사로부터 유상으로 제공받은 콘텐츠 등을 제3자와 유ㆍ무상 등의 방법으로 거래하는 경우\n" +
                "7. 회사의 서비스 운영을 고의로 방해 하거나 그리할 목적으로 다량의 정보를 전송하거나 광고성 정보를\n" +
                "전송하는 경우\n" +
                "8. 관계법령 및 기타 본 약관에서 규정한 사항을 위반한 경우\n" +
                "9. 회사 및 타인의 명예를 훼손하거나 모욕하는 경우 등\n" +
                "\n" +
                "제16조 (부정이용 금지 및 차단)\n" +
                "① 회사는 다음 각호에 해당하는 경우를 부정 이용행위로 봅니다.\n" +
                "1. 타 회원의 게시글 원문을 본 서비스가 아닌 다른 서비스에 게시 하거나 그에 준하는 행동을 하는 행위\n" +
                "2. 타 회원의 사용성을 저해 할 정도로 게시물을 지속 반복적으로 게시하는 행위\n" +
                "3. 비정상적인 경로를 통해 서비스를 이용하는 행위\n" +
                "4. 기타 운영자 판단하에 서비스 이용에 부적절하다고 판단되는 경우\n" +
                "\n" +
                "② 회사는 전항에 따른 부정 이용자가 발견 되었을 경우, 다음 각호에 따른 조치를 취할 수 있습니다.\n" +
                "1. [1차 발견 시] - 전자우편, 쪽지, 팝업창을 통하여 경고합니다.\n" +
                "2. [2차 발견 시] - 전호와 동일한 방법으로 경고하고 동시에 서비스 제공을 정지합니다.\n" +
                "이때, 가족관계를 확인할 수 있는 주민등록등본을 첨부하여 “재발방지확약ㆍ보증서”를 회사에 송달하는 경우에는 서비스 제공을 재개합니다.\n" +
                "3. [3차 발견 시] - 전자우편, 쪽지, 팝업창 또는 유ㆍ무선을 통하여 3차 위반내용의 통지 및 서비스 제공을 정지하고 30일간의 소명기간 부여하며, 정당한 사유가 없는 경우 강제 탈퇴처리 합니다.\n" +
                "\n" +
                "③ 회원은 회사로부터의 본조 제2항의 조치에 이의가 있는 경우 회사 고객센터 또는 부정사용관리센터에 해당 사실에 대하여 소명할 수 있으며, 회원이 자신의 고의나 과실이 없었음을 입증한 경우 회사는 서비스를 제공 합니다.\n" +
                "④ 부정이용 식별방법 및 차단\n" +
                "1. 회사는 회원의 서비스 이용 중에 수집ㆍ확인된 IP정보 등의 자료를 토대로 서버를 통하여 부정이용\n" +
                "여부를 분류ㆍ확인합니다.\n" +
                "2. 회사는 이용자가 서비스 이용 중에 복제프로그램을 실행시키거나 비정상적인 경로로 접속을 하는 경우\n" +
                "서비스 이용 접속을 강제로 차단합니다.\n" +
                "\n" +
                "제17조 (서비스의 제공 및 변경)\n" +
                "① 회사는 연중무휴, 1일 24시간 서비스 제공을 원칙으로 합니다.\n" +
                "② 회사는 운영상 또는 기술상 등의 상당한 이유가 있는 경우 미리 공지하거나 부득이한 상황에는 제공하고 있는 서비스를 중지 후 회원에게 사후 통지를 할 수 있습니다.\n" +
                "③ 전항에 따라 서비스가 변경되는 경우에는 변경되는 사유 및 내용을 본 약관 제7조에 따른 방법으로 회원에게 통지합니다.\n" +
                "\n" +
                "\n" +
                "제18조 (정보의 제공 및 광고의 게재 등)\n" +
                "① 회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 또는 유선상 등의 방법으로 회원에게 제공할 수 있습니다. 다만, 회원은 언제든지 전자우편 등을 통하여 수신 거절을 할 수 있습니다.\n" +
                "② 회사는 서비스 제공과 관련하여 해당 서비스 화면, 회사 웹사이트, 회원가입 시 회원이 직접 작성한 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편 등을 수신한 회원은 수신거절을 할 수 있습니다.\n" +
                "③ 회사는 회원이 온라인에 작성한 모든 컨텐츠를 회사의 광고 또는 기타 목적으로 활용 할 수 있습니다.\n" +
                "\n" +
                "제19조 (회원이 등록한 게시물의 이용 및 삭제)\n" +
                "① 회사는 회원이 등록한 게시물 중 본 약관 및 관계법령 등에 위배되는 게시물이 있는 경우 이를 지체없이 삭제합니다.\n" +
                "② 회사가 운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 회사에게 당해 정보의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 이 경우 회사는 지체없이 필요한 조치를 취하고 이를 즉시 신청인에게 통지합니다.\n" +
                "③ 회사는 회사가 제공하는 웹사이트에 회원이 게시한 게시물을 이용·수정하여 마케팅 및 출판 등에 활용할 수 있습니다.\n" +
                "④ 회원은 전항에 따른 회사의 이용 등에 대하여 웹사이트 등을 통하여 철회 할 수 있으며, 회사는 회원의 철회의사를 받은 후로부터 해당 회원의 게시물을 사용하지 않습니다. 단, 회사는 철회의 의사표시 전 기 제작된 제작물에 대하여는 사용할 수 있습니다.\n" +
                "\n" +
                "제20조 (저작권)\n" +
                "① 회사가 제공하는 모든 콘텐츠에 대한 저작권은 회사에 있습니다.\n" +
                "② 회원은 회사가 제공하는 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙없이 녹화ㆍ복제ㆍ편집ㆍ전시ㆍ전송ㆍ배포ㆍ판매ㆍ방송ㆍ공연하는 등의 행위로 회사의 저작권을 침해 하여서는 안됩니다.\n" +
                "③ 회원이 본 서비스에 제공한 콘텐츠에 대한 저작권은 회사에 있습니다 단, 회사의 승낙을 받은 서브라이센스 형태는 가능 합니다.\n" +
                "\n" +
                "제21조 (개인정보보호)\n" +
                "① 회사는 회원의 개인정보보호를 중요시하며, 회원이 회사의 서비스를 이용함과 동시에 온라인상에서 회사에게 제공한 개인정보의 철저한 보호를 위하여 최선을 다하고 있습니다.\n" +
                "② 개인정보보호와 관련된 자세한 사항은 회사 웹사이트에서 전자적 표시형태로 제공되는 개인정보처리방침에서 확인하실 수 있습니다.\n" +
                "\n" +
                "제 4 장 기타\n" +
                "제22조 (면책조항)\n" +
                "① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.\n" +
                "② 회사는 회원의 귀책사유로 인하여 발생한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.\n" +
                "③ 회사는 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.\n" +
                "④ 회사는 이용자 상호간 또는 이용자와 제3자 간에 콘텐츠를 매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다.\n" +
                "⑤ 회사가 더 이상 서비스를 지속 할 수 없다고 판단되면 본 서비스 제공에 관한 책임이 면제 됩니다.\n" +
                "\n" +
                "제22조 (분쟁의 해결 등)\n" +
                "① 회사와 이용자 간의 콘텐츠 거래 또는 이용에 관한 분쟁은 콘텐츠분쟁조정위원회를 통해 조정할 수 있습니다.\n" +
                "② 회사와 이용자 간에 발생한 소송의 관할은 제소 당시 이용자의 주소 또는 거소를 관할하는 법원을 전속관할로 합니다. 단, 제소 당시 이용자의 주소 또는 거소가 불분명한 경우에는 민사소송법에 따릅니다.\n";
    }

    private String 개인정보처리방침정보(){
        return "# 개인정보처리방침\n" +
                "\n" +
                "<Project2309>은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.\n" +
                "\n" +
                "<Project2309>은(는) 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.\n" +
                "\n" +
                "○ 본 방침은부터 2020년 9월 14일부터 시행됩니다.\n" +
                "1. 개인정보의 처리 목적 <Project2309>은(는) 개인정보를 다음의 목적을 위해 처리합니다.\n" +
                "\n" +
                "처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.\n" +
                "\n" +
                "(1) 홈페이지 회원가입 및 관리　\n" +
                "\n" +
                "1. 회원제 서비스 제공에 따른 본인 식별·인증　\n" +
                "2. 회원자격 유지·관리　\n" +
                "3. 제한적 본인 확인제 시행에 따른 본인확인　\n" +
                "4. 각종 고지·통지　\n" +
                "5. 분쟁 조정을 위한 기록 보존　\n" +
                "6. 서비스 이용 기록, IP Address, 쿠키, 접속기기 모델명, 화면 정보 및 OS 정보 등은 자동으로 수집되며, 서비스의 부정 이용 방지, 이용 내역 확인 및 통계, 고객 문의 사항 처리, 그리고 서비스 개선 등의 목적으로 활용\n" +
                "\n" +
                "(2) 민원사무 처리　\n" +
                "\n" +
                "① 민원인의 신원 확인　\n" +
                "② 민원사항 확인사실조사를 위한 연락·통지　\n" +
                "③ 처리결과 통보\n" +
                "\n" +
                "(3) 재화 또는 서비스 제공　\n" +
                "\n" +
                "① 서비스 제공　\n" +
                "② 콘텐츠 제공　\n" +
                "③ 본인인증　\n" +
                "\n" +
                "(4) 마케팅 및 광고에의 활용　\n" +
                "\n" +
                "① 서비스의 유효성 확인　\n" +
                "② 서비스 개선의 척도로 활용\n" +
                "\n" +
                "2. 개인정보의 처리 및 보유 기간\n" +
                "\n" +
                "① <Project2309>은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.\n" +
                "② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.　\n" +
                "\n" +
                "1.<홈페이지 회원가입 및 관리>　\n" +
                "\n" +
                "<홈페이지 회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터 <준영구(2년 재동의)>까지 위 이용목적을 위하여 보유.이용됩니다.　\n" +
                "-보유근거 : 개인정보처리방침 및 이용 약관, 정보주체의 동의　\n" +
                "\n" +
                "2.<민원사무 처리>　\n" +
                "<민원사무 처리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터 <준영구(2년 재동의)>까지 위 이용목적을 위하여 보유.이용됩니다.　\n" +
                "-보유근거 : 개인정보처리방침 및 이용 약관, 정보주체의 동의　\n" +
                "\n" +
                "3.<제화 또는 서비스 제공>　\n" +
                "<제화 또는 서비스 제공>와 관련한 개인정보는 수집.이용에 관한 동의일로부터 <준영구(2년 재동의)>까지 위 이용목적을 위하여 보유.이용됩니다.　\n" +
                "-보유근거 : 개인정보처리방침 및 이용 약관, 정보주체의 동의　\n" +
                "\n" +
                "4.<마케팅 및 광고에의 활용>　\n" +
                "<마케팅 및 광고에의 활용>와 관련한 개인정보는 수집.이용에 관한 동의일로부터 <준영구(2년 재동의)>까지 위 이용목적을 위하여 보유.이용됩니다.　\n" +
                "-보유근거 : 개인정보처리방침 및 이용 약관, 정보주체의 동의　\n" +
                "\n" +
                "3. 개인정보처리 위탁　\n" +
                "\n" +
                "지적재산권\n" +
                "① \"회원\"은 \"서비스\" 에 제공한 \"회원\"의 \"콘텐츠\"(게시판에 게시한 글 등 \"회원\"이 서비스에 제공하거나 서비스를 이용하면서 업로드한 자료 일체)와 관련하여 저작권, 인격권 등 제 3자와의 분쟁 발생 시 그 법적 대응 및 결과에 대한 책임을 지지 않고, \"Project2309\"는 해당 \"콘텐츠\"와 관련된 일체의 책임을 명시적으로 부인합니다.\n" +
                "② \"Project2309\"는 \"서비스\"를 통한 저작권 침해행위나 지적재산권 침해를 허용하지 아니하며, \"회원\"의 \"콘텐츠\"가 타인의 지적재산권을 침해한다는 사실을 적절하게 고지 받거나 인지하게 되는 경우 저작권법 기타 관련 법령에서 정한 절차에 따라 그 \"콘텐츠\" 일체의 서비스를 중지 하거나 제거할 수 있습니다. 또한 \"Project2309\"는 \"회원\"의 \"콘텐츠\"가 \"서비스\" 운영 상의 문제가 있다고 판단하는 경우 사전 통지 없이 삭제하거나 이동 또는 등록 거부할 수 있는 권리를 보유합니다.\n" +
                "③ \"회원\"의 \"콘텐츠\"에 대한 저작권은 원래의 저작자가 보유하되, 본 약관이 정하는 바에 따라 \"Project2309\" 혹은 \"Project2309 지정한 자\"에게 \"콘텐츠\"에 대한 사용 권한을 부여합니다. \"Project2309\"가 \"회원\"의 \"콘텐츠\"를 사용하는 용도와 방법은 아래와 같습니다.　\n" +
                "(1) \"회원\"이 \"서비스\"에 제공한 \"콘텐츠\"를 타 회원 기타 이용자가 시청하도록 함.　\n" +
                "(2) \"회원\"이 \"서비스\"에 제공한 \"콘텐츠\"를 \"Project2309\"나 타 회원 기타 이용자가 녹화/편집/변경하여 새로운 콘텐츠로 제작한 다음 이를 \"서비스\"의 타 회원 기타 이용자들이 시청하게 하거나, 또는 \"Project2309\"의 제휴사에 제공하여 그 이용자들이 이를 시청할 수 있도록 함.　\n" +
                "④ 본 조 제③항에 규정한 \"Project2309\", \"타 회원 기타 이용자\" 및 \"Project2309의 제휴사\"가 \"회원\"의 \"콘텐츠\"를 이용할 수 있는 조건은 아래와 같습니다.　\n" +
                "(1) 콘텐츠 이용 매체/플랫폼 - 현재 알려져 있거나 앞으로 개발된 모든 형태의 매체, 장비, 기술을 포함함.　\n" +
                "(2) 콘텐츠 이용 용도 - 상업적 또는 비상업적 이용을 구분하지 않음.　\n" +
                "(3) 콘텐츠 이용 범위 - 국내 및 국외에서의 복제, 수정, 각색, 공연, 전시, 방송, 배포, 대여, 공중송신, 2차적 저작물 작성, 기타 이용　\n" +
                "(4) 콘텐츠 이용 조건 - 비독점적, 지속적인 무상의 권리로서 양도 가능하며, 취소 불가하고 서브 라이센스가 가능함.\n" +
                "⑤ 본 조 제③항의 \"회원\"의 사용허락은 \"Project2309\"가 공지, 이용 안내에서 정한 바에 따라 장래에 대하여 철회할 수 있습니다.\n" +
                "\n" +
                "제25조 관할법원과 준거법　\n" +
                "(1) 서비스 이용에 관하여 Project2309와 이용자 간에 분쟁이 발생한 경우 협의로 원만히 해결합니다　\n" +
                "(2) 전항으로 해결되지 아니할 경우 소송의 관할은 “Project2309”의 주소를 기준으로 합니다.　\n" +
                "(3) 본 약관의 해석 및 적용은 대한민국 법령을 기준으로 합니다.\n" +
                "\n" +
                "4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.\n" +
                "① 정보주체는 <Project2309>에 대해 언제든지 개인정보 열람,정정,삭제,처리 정지 요구 등의 권리를 행사할 수 있습니다.\n" +
                "② 제1항에 따른 권리 행사는 <Project2309>에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 <Project2309>은(는) 이에 대해 지체 없이 조치하겠습니다.\n" +
                "③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.\n" +
                "④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.\n" +
                "⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.\n" +
                "⑥ <Project2309>은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.\n" +
                "\n" +
                "5. 처리하는 개인정보의 항목 작성\n" +
                "① <Project2309>은(는) 다음의 개인정보 항목을 처리하고 있습니다.　\n" +
                "(1) <홈페이지 회원가입 및 관리>　\n" +
                "- 필수항목 : 닉네임, 이메일, 비밀번호, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보　\n" +
                "(2) <민원사무 처리>　\n" +
                "- 필수항목 : 닉네임, 이메일, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보　\n" +
                "(3) <제화 또는 서비스 제공>　\n" +
                "- 필수항목 : 닉네임, 이메일, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보\n" +
                "(4) <마케팅 및 광고에의 활용>　\n" +
                "- 필수항목 : 닉네임, 이메일, 서비스 이용 기록, '회원'이 '서비스'에 제공한 '콘텐츠(게시판에 게시한 글 등)'\n" +
                "\n" +
                "6. 개인정보의 파기<Project2309>은(는) 원칙적으로 개인정보의 수집 및 이용 목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.\n" +
                "\n" +
                "① 파기절차\n" +
                "이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다.\n" +
                "이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.\n" +
                "② 파기기한\n" +
                "이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 3달 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 3달 이내에 그 개인정보를 파기합니다.\n" +
                "③ 파기방법\n" +
                "전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.\n" +
                "종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.\n" +
                "\n" +
                "7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항\n" +
                "① <Project2309>은(는) 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다.\n" +
                "② 쿠키는 웹사이트를 운영하는데 이용되는 서버(https)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.　\n" +
                "(1) 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.　\n" +
                "(2) 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.\n" +
                "③ 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.\n" +
                "\n" +
                "8. 개인정보 보호책임자 작성\n" +
                "① Project2309은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.　\n" +
                "\n" +
                "▶ 개인정보 보호책임자　\n" +
                "성명 : 배희진　\n" +
                "직책 : 개인정보보호 책임자　\n" +
                "연락처 : 01067274487, qogmlwls9@gmail.com　\n" +
                "\n" +
                "▶ 개인정보 보호 담당자　\n" +
                "성명 : 배희진　\n" +
                "직책 : 개인정보보호 담당자　\n" +
                "연락처 : 01067274487, qogmlwls9@gmail.com\n" +
                "\n" +
                "※ 개인정보 보호 담당부서로 연결됩니다.\n" +
                "② 정보주체께서는 Project2309의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. Project2309은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.\n" +
                "\n" +
                "9. 개인정보 처리방침 변경\n" +
                "① 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.\n" +
                "\n" +
                "10. 개인정보의 안전성 확보 조치 <Project2309>은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.\n" +
                "① 정기적인 자체 감사 실시\n" +
                "개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.\n" +
                "② 개인정보 취급 직원의 최소화 및 교육\n" +
                "개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.\n" +
                "③ 내부관리계획의 수립 및 시행\n" +
                "개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.\n" +
                "④ 해킹 등에 대비한 기술적 대책\n" +
                "<Project2309>은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.\n" +
                "⑤ 개인정보의 암호화\n" +
                "이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 이용 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.\n" +
                "⑥ 접속기록의 보관 및 위변조 방지\n" +
                "개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.\n" +
                "⑦ 개인정보에 대한 접근 제한\n" +
                "개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.\n" +
                "⑧ 문서보안을 위한 잠금장치 사용\n" +
                "개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.\n" +
                "⑨ 비인가자에 대한 출입 통제\n" +
                "개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.";
    }


    public String getTermTitle(int type) {

        if (type == 이용약관) {
            return 이용약관제목;
        } else if (type == 개인정보처리방침) {
            return 개인정보처리방침제목;
        } else {
            return "";
        }

    }

    public String getTermContent(int type){
        if (type == 이용약관) {
            return 이용약관정보();
        } else if (type == 개인정보처리방침) {
            return 개인정보처리방침정보();
        } else {
            return "";
        }
    }

}
